lab11/nrf5x-base/lib/simple_ble.c
    for (; irq < MAX_NUMBER_INTERRUPTS; irq++)
    {
        if (interrupt_setting_mask & (IRQ_ENABLED << irq))
        {
            // The interrupt was enabled, and hence disable it.
            NVIC_DisableIRQ((IRQn_Type)irq);
        }
    }
}
#endif

#define LED_PIN 13

static void on_ble_evt(ble_evt_t * p_ble_evt) {
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED:
            app.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            // continue advertising, but nonconnectably
            //m_adv_params.type = BLE_GAP_ADV_TYPE_ADV_SCAN_IND;
            //advertising_start();
            // connected to device. Set initial CCCD attributes to NULL
            //err_code = sd_ble_gatts_sys_attr_set(app.conn_handle, NULL, 0, 0);
            //APP_ERROR_CHECK(err_code);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);

            // callback for user. Weak reference, so check validity first
            if (ble_evt_connected) {
                ble_evt_connected(p_ble_evt);
            }
            break;

        case BLE_GAP_EVT_SCAN_REQ_REPORT:
            led_toggle(LED_PIN);
            led_toggle(LED_PIN);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            app.conn_handle = BLE_CONN_HANDLE_INVALID;
            advertising_stop();
#ifdef ENABLE_DFU
            // if pending dfu, clear and disable irq and then reset to bootloader
            if (pending_dfu) {
                pending_dfu = 0;
                dfu_reset();
            }
#endif
            // go back to advertising connectably
            m_adv_params.type = BLE_GAP_ADV_TYPE_ADV_IND;
            advertising_start();

            // callback for user. Weak reference, so check validity first
            if (ble_evt_disconnected) {
                ble_evt_disconnected(p_ble_evt);
            }
            break;

        case BLE_GATTS_EVT_WRITE:
#ifdef ENABLE_DFU
            // if written to dfu ctrl pt
            if (simple_ble_is_char_event(p_ble_evt, &dfu_ctrlpt_char)) {
                pending_dfu = 1;
                // disconnect, wait for event.
                err_code = sd_ble_gap_disconnect(app.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;
            }
#endif
            // callback for user. Weak reference, so check validity first
            if (ble_evt_write) {
                ble_evt_write(p_ble_evt);
            }
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            // callback for user. Weak reference, so check validity first
            if (ble_evt_rw_auth) {
                ble_evt_rw_auth(p_ble_evt);
            }
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            err_code = sd_ble_gap_sec_params_reply(app.conn_handle,
                    BLE_GAP_SEC_STATUS_SUCCESS, &m_sec_params, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            err_code = sd_ble_gatts_sys_attr_set(app.conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_AUTH_STATUS:
            break;

        case BLE_GAP_EVT_SEC_INFO_REQUEST:
            // No keys found for this device.
            err_code = sd_ble_gap_sec_info_reply(app.conn_handle, NULL, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING) {
                err_code = sd_power_system_off();
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            if (p_ble_evt->evt.gatts_evt.params.timeout.src == BLE_GATT_TIMEOUT_SRC_PROTOCOL) {
                err_code = sd_ble_gap_disconnect(app.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_GAP_EVT_ADV_REPORT:
            {
#ifdef ENABLE_DFU
#ifdef SOFTDEVICE_s130
              // check if DFU advertisement
              uint8_t data[31];
              int len = parse_adata(p_ble_evt, 0xFF, data);

              if (len > 4 && len <= 31 &&
                  *((short *) data) == 0x02E0 &&
                  data[2] == DFU_ADV_DATA_TYPE &&
                  data[3] == DFU_ADV_DATA_VERS)
              {
                ble_gap_addr_t gap_addr;
                sd_ble_gap_address_get(&gap_addr);

                if (memcmp(data+4, gap_addr.addr, 6) == 0) {
                  dfu_reset();
                }
              }
#endif
#endif

              if (ble_evt_adv_report) {
                  ble_evt_adv_report(p_ble_evt);
              }
              break;
            }

        default:
            break;
    }

    // allow users to handle events themselves if they want
    //  weak reference, check validity before calling
    if (ble_evt_user_handler) {
        ble_evt_user_handler(p_ble_evt);
    }
}

// handle radio events
void SWI1_IRQHandler(bool radio_evt) {
  if (radio_evt) {
    // a radio event occurred, call user function if exists
    if (ble_after_adv_event) {
      ble_after_adv_event();
    }
  }
}


/*******************************************************************************
 *   INIT FUNCTIONS
 ******************************************************************************/

// Get radio event notifications
uint32_t radio_notification_init (void) {
  uint32_t err_code;

  // configurations
  uint32_t irq_priority = 3;
  uint8_t notification_type = NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE;
  uint8_t notification_distance = NRF_RADIO_NOTIFICATION_DISTANCE_800US;

  err_code = sd_nvic_ClearPendingIRQ(SWI1_IRQn);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  err_code = sd_nvic_SetPriority(SWI1_IRQn, irq_priority);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  err_code = sd_nvic_EnableIRQ(SWI1_IRQn);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  // Configure the event
  return sd_radio_notification_cfg_set(notification_type, notification_distance);
}

// Configure the MAC address of the device based on the config values and
// what is stored in the flash.
void __attribute__((weak)) ble_address_set (void) {
    uint32_t err_code;

    // Set the MAC address of the device
    // Highest priority is address from flash if available
    // Next is is the address supplied by user in ble_config
    // Finally, Nordic assigned random value is used as last choice
    ble_gap_addr_t gap_addr;

    // get BLE address from Flash
    uint8_t* _ble_address = (uint8_t*)BLEADDR_FLASH_LOCATION;
    if (_ble_address[1] == 0xFF && _ble_address[0] == 0xFF) {
        // No user-defined address stored in flash

        // New address is a combination of Michigan OUI and Platform ID
        uint8_t new_mac_addr[6] = {0x00, 0x00, ble_config->platform_id, 0xe5, 0x98, 0xc0};

        // Check if we should use the Nordic assigned random value for the
        // lower two bytes or use a user configured value.
        if (ble_config->device_id != DEVICE_ID_DEFAULT) {
            new_mac_addr[0] = ble_config->device_id & 0xFF;
            new_mac_addr[1] = (ble_config->device_id >> 8) & 0xFF;
            memcpy(gap_addr.addr, new_mac_addr, sizeof(gap_addr.addr));

        } else {
            // Set the new BLE address with the Michigan OUI, Platform ID, and
            //  bottom two octets from the original gap address
            // Get the current original address
            sd_ble_gap_address_get(&gap_addr);
            memcpy(gap_addr.addr+2, new_mac_addr+2, sizeof(gap_addr.addr)-2);
        }
    } else {
        // User-defined address stored in flash

        // Set the new BLE address with the user-defined address
        memcpy(gap_addr.addr, _ble_address, 6);
    }

#ifdef ENABLE_DFU
    // write ble address to memory to share with bootloader
    memcpy((uint8_t*)BOOTLOADER_BLE_ADDR_START, gap_addr.addr, 6);
#endif
    gap_addr.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC;
    err_code = sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_NONE, &gap_addr);
    APP_ERROR_CHECK(err_code);
}

// Init the crystal and softdevice, plus configure the device address
void __attribute__((weak)) ble_stack_init (void) {
    uint32_t err_code;

#ifdef SOFTDEVICE_s130
    // Softdevice 130 2.0.0 changes how the softdevice init procedure works.
    nrf_clock_lf_cfg_t clock_lf_cfg = {
        .source        = NRF_CLOCK_LF_SRC_RC,
        .rc_ctiv       = 16, // bradjc: I mostly made these up based on docs. May be not great.
        .rc_temp_ctiv  = 2,
        .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_250_PPM};

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    // Initialize the SoftDevice handler module.
    // SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_TEMP_4000MS_CALIBRATION, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT, // central link count
                                                    PERIPHERAL_LINK_COUNT, // peripheral link count
                                                    &ble_enable_params);
    ble_enable_params.common_enable_params.vs_uuid_count = BLE_UUID_VS_COUNT_DEFAULT;
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // create radio notifications to get advertising events
    //err_code = radio_notification_init();
    //APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

#else // softdevice s110 and possibly others

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_8000MS_CALIBRATION,
            false);

    // create radio notifications to get advertising events
    err_code = radio_notification_init();
    APP_ERROR_CHECK(err_code);

    //err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    //APP_ERROR_CHECK(err_code);

