lab11/nrf5x-base/lib/simple_ble.c
    // Enable BLE stack
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
#endif

    //Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // And set the MAC address in the init phase
    ble_address_set();
}

void __attribute__((weak)) gap_params_init (void) {
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    // Full strength signal
    sd_ble_gap_tx_power_set(4);

    // Let anyone connect and set the name given the platform
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
            (const uint8_t *)ble_config->adv_name, strlen(ble_config->adv_name));
    APP_ERROR_CHECK(err_code);

    // Not sure what this is useful for, but why not set it
    //err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_COMPUTER);
    //APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) advertising_init(void) {
    memset(&m_adv_params, 0, sizeof(m_adv_params));
    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
    m_adv_params.p_peer_addr = NULL;
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = ble_config->adv_interval;
    m_adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;
}

void __attribute__((weak)) conn_params_init(void) {
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;
    ble_gap_conn_params_t  conn_params;

    // Specify parameters for a connection
    memset(&conn_params, 0, sizeof(conn_params));
    conn_params.min_conn_interval = ble_config->min_conn_interval;
    conn_params.max_conn_interval = ble_config->max_conn_interval;
    conn_params.slave_latency     = SLAVE_LATENCY;
    conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&conn_params);
    APP_ERROR_CHECK(err_code);

    // setup connection parameter negotiation
    memset(&cp_init, 0, sizeof(cp_init));
    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = on_conn_params_evt;
    cp_init.error_handler = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) services_init (void) {
}

#ifdef ENABLE_DFU
void __attribute__((weak)) dfu_init (void) {

    simple_ble_add_service(&dfu_service);
    // Add ctrl pt characteristic
    simple_ble_add_characteristic(0,1,1,1,
        BLE_L2CAP_MTU_DEF, NULL,
        &dfu_service,&dfu_ctrlpt_char);
}

void __attribute__((weak)) dfu_reset_prepare (void) {
}

void dfu_reset() {
    int err_code = 0;

    // set flag for bootloader to enter dfu
    err_code = sd_power_gpregret_clr(0xFF);
    APP_ERROR_CHECK(err_code);
    err_code = sd_power_gpregret_set(BOOTLOADER_DFU_START);
    APP_ERROR_CHECK(err_code);

    dfu_reset_prepare();
    err_code = sd_softdevice_disable();
    APP_ERROR_CHECK(err_code);

    err_code = sd_softdevice_vector_table_base_set(NRF_UICR->BOOTLOADERADDR);
    APP_ERROR_CHECK(err_code);

    NVIC_ClearPendingIRQ(SWI2_IRQn);
    interrupts_disable();
    bootloader_util_app_start(NRF_UICR->BOOTLOADERADDR);
}
#endif

void __attribute__((weak)) initialize_app_timer (void) {
    // allow user to overwrite if they want to change timer parameters
#ifdef SDK_VERSION_9
    // old version of the API specifying maximum number of timers
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
#else
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
#endif
}


/*******************************************************************************
 *   HELPER FUNCTIONS
 ******************************************************************************/
void __attribute__((weak)) advertising_start(void) {
    uint32_t err_code = sd_ble_gap_adv_start(&m_adv_params);
#ifdef SOFTDEVICE_s130
    if (err_code == NRF_ERROR_CONN_COUNT) {
        // ignore Connection Count problems. Connectable advertising seems to work just fine
        return;
    }
#endif
    if (err_code != NRF_ERROR_INVALID_STATE) {
        // ignore Invalid State responses. Occurs when start is called twice
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) advertising_stop(void) {
    uint32_t err_code = sd_ble_gap_adv_stop();
    if (err_code != NRF_ERROR_INVALID_STATE) {
        // ignore Invalid State responses. Occurs when stop is called although
        //  advertising is not running
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) power_manage(void) {
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*******************************************************************************
 *   SIMPLE BLE API
 ******************************************************************************/

simple_ble_app_t* simple_ble_init(const simple_ble_config_t* conf) {
    ble_config = conf;

led_init(LED_PIN);

    // Setup BLE and services
    ble_stack_init();

uint32_t opt_id = BLE_GAP_OPT_SCAN_REQ_REPORT;
ble_opt_t ble_options;
ble_options.gap_opt.scan_req_report.enable = 1;
int err_code = sd_ble_opt_set(opt_id, &ble_options);
APP_ERROR_CHECK(err_code);

    gap_params_init();
    advertising_init();
    //services_init();

    // create device information service
#if defined(HW_REVISION) || defined(FW_REVISION)
    //simple_ble_device_info_service_automatic();
#endif

    // enable device firmware updates
#ifdef ENABLE_DFU
    //dfu_init();
#endif

    // APP_TIMER_INIT must be called before conn_params_init since it uses timers
    initialize_app_timer();
    //conn_params_init();

    // initialize our connection state to "not in a connection"
    app.conn_handle = BLE_CONN_HANDLE_INVALID;

    // Return a reference to the application state so that the user of this
    // module has a pointer to the connection handle.
    return &app;
}

void simple_ble_add_service (simple_ble_service_t* service_handle) {
    uint32_t err_code;

    // Setup our long UUID so that nRF recognizes it. This is done by storing
    //  the full 128-bit UUID and using 16 bits of it as a handle
    uint16_t uuid16 = (service_handle->uuid128.uuid128[12] << 8) |(service_handle->uuid128.uuid128[13]);
    if (!service_handle->uuid_handle.uuid) {
      service_handle->uuid_handle.uuid = uuid16;
    }
    err_code = sd_ble_uuid_vs_add(&(service_handle->uuid128), &(service_handle->uuid_handle.type));
    APP_ERROR_CHECK(err_code);

    // Add the custom service to the system
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
            &(service_handle->uuid_handle), &(service_handle->service_handle));
    APP_ERROR_CHECK(err_code);
}

void simple_ble_add_characteristic (uint8_t read,
                                    uint8_t write,
                                    uint8_t notify,
                                    uint8_t vlen,
                                    uint16_t len,
                                    uint8_t* buf,
                                    simple_ble_service_t* service_handle,
                                    simple_ble_char_t* char_handle) {
    volatile uint32_t err_code;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          char_uuid;
    ble_gatts_attr_md_t attr_md;

