lab11/nrf5x-base/lib/simple_ble.c
    // set characteristic metadata
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read   = read;
    char_md.char_props.write  = write;
    char_md.char_props.notify = notify;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = NULL;
    char_md.p_sccd_md         = NULL;

    // set characteristic uuid
    char_uuid.type = service_handle->uuid_handle.type;
    char_uuid.uuid = char_handle->uuid16;

    // set attribute metadata
    memset(&attr_md, 0, sizeof(attr_md));
    if (read) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    if (write) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    attr_md.vloc    = BLE_GATTS_VLOC_USER;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = vlen;

    // set attribute data
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid    = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = len; // max len can be up to BLE_GATTS_FIX_ATTR_LEN_MAX (510)
    attr_char_value.p_value   = buf;

    err_code = sd_ble_gatts_characteristic_add((service_handle->service_handle),
            &char_md, &attr_char_value, &(char_handle->char_handle));
    APP_ERROR_CHECK(err_code);
}

uint32_t simple_ble_update_char_len (simple_ble_char_t* char_handle, uint16_t len) {
    volatile uint32_t err_code;

    ble_gatts_value_t value_config;
    value_config.len = len;
    value_config.offset = 0;
    value_config.p_value = NULL;

    // Update length for vlen variable stored in user-space (VLOC_USER)
    err_code = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, char_handle->char_handle.value_handle, &value_config);
    // since this isn't a configuration-time call, actually return the error
    //  code to the user for handling rather than checking it ourselves and
    //  possibly crashing the app
    return err_code;
}

uint32_t simple_ble_notify_char (simple_ble_char_t* char_handle) {
    volatile uint32_t err_code;

    // can't notify if we aren't in a connection
    if (app.conn_handle == BLE_CONN_HANDLE_INVALID) {
        // not an error though
        return NRF_SUCCESS;
    }

    ble_gatts_hvx_params_t hvx_params;
    hvx_params.handle = char_handle->char_handle.value_handle;
    hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len = NULL; // notify full length. No response wanted
    hvx_params.p_data = NULL; // use existing value

    err_code = sd_ble_gatts_hvx(app.conn_handle, &hvx_params);
    if (err_code == NRF_ERROR_INVALID_STATE) {
        // error means notify is not enabled by the client. IGNORE
        return NRF_SUCCESS;
    }

    // since this isn't a configuration-time call, actually return the error
    //  code to the user for handling rather than checking it ourselves and
    //  possibly crashing the app
    return err_code;
}

bool simple_ble_is_char_event (ble_evt_t* p_ble_evt, simple_ble_char_t* char_handle) {
    ble_gatts_evt_write_t* p_evt_write = &(p_ble_evt->evt.gatts_evt.params.write);

    return (bool)(p_evt_write->handle == char_handle->char_handle.value_handle);
}

void simple_ble_add_auth_characteristic (uint8_t read,
                                    uint8_t write,
                                    uint8_t notify,
                                    uint8_t vlen,
                                    bool read_auth,
                                    bool write_auth,
                                    uint16_t len,
                                    uint8_t* buf,
                                    simple_ble_service_t* service_handle,
                                    simple_ble_char_t* char_handle) {
    volatile uint32_t err_code;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          char_uuid;
    ble_gatts_attr_md_t attr_md;

    // set characteristic metadata
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read   = read;
    char_md.char_props.write  = write;
    char_md.char_props.notify = notify;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = NULL;
    char_md.p_sccd_md         = NULL;

    // set characteristic uuid
    char_uuid.type = service_handle->uuid_handle.type;
    char_uuid.uuid = char_handle->uuid16;

    // set attribute metadata
    memset(&attr_md, 0, sizeof(attr_md));
    if (read) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    if (write) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    attr_md.vloc    = BLE_GATTS_VLOC_USER;
    attr_md.rd_auth = read_auth;
    attr_md.wr_auth = write_auth;
    attr_md.vlen    = vlen;

    // set attribute data
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid    = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = len; // max len can be up to BLE_GATTS_FIX_ATTR_LEN_MAX (510)
    attr_char_value.p_value   = buf;

    err_code = sd_ble_gatts_characteristic_add((service_handle->service_handle),
            &char_md, &attr_char_value, &(char_handle->char_handle));
    APP_ERROR_CHECK(err_code);
}

bool simple_ble_is_read_auth_event (ble_evt_t* p_ble_evt, simple_ble_char_t* char_handle) {
    ble_gatts_evt_rw_authorize_request_t* p_auth_req =
            &(p_ble_evt->evt.gatts_evt.params.authorize_request);

    if (p_auth_req->type == BLE_GATTS_AUTHORIZE_TYPE_READ) {
        // read authorization
        uint16_t read_handle = p_auth_req->request.read.handle;
        if (read_handle == char_handle->char_handle.value_handle) {
            // read request for the matching characteristic
            return true;
        }
    }

    return false;
}

